[
  {
    "title": "Software Engineer",
    "subtitle": "DID.coop",
    "url": "#",
    "location": "United States",
    "start_date": "Nov 2024",
    "end_date": "Present",
    "description": [
      "Developed cross-domain data portability for the Hollo ActivityPub server, enabling smooth user migration (profiles, posts, followers) across federated servers.",
      "Built secure export/import features with Hono, Bun, PostgreSQL, and Drizzle ORM; incorporated wallet-linked encrypted storage.",
      "Created a CLI tool for validating Activity Streams 2.0 tarball files, ensuring protocol compliance and reliable data processing.",
      "Utilized Sentry for debugging and error tracking, helping identify and resolve issues in production environments more efficiently."
    ]
  },
  {
    "title": "Fullstack Web Developer",
    "subtitle": "TrustClaim & LinkedClaims Projects",
    "url": "https://trustclaimproject.com/",
    "location": "Remote",
    "start_date": "Dec 2023",
    "end_date": "Current",
    "description": [
      "Spearheaded backend development for TrustClaim Website, leveraging Node.js and Prisma to enhance functionality and user experience.",
      "Collaborated in UI/UX design, implementing user interfaces with ReactJs and Material-UI for intuitive navigation and aesthetic appeal.",
      "Played a key role in the LinkedClaims Project, advancing web3 technologies using Solid Server and Google SDK to forge secure, decentralized applications.",
      "Ensured robust application performance and security, contributing to the project's success in the evolving landscape of web3 solutions."
    ]
  },
  {
    "title": "Fullstack Developer",
    "subtitle": "Modareseen.com",
    "url": "https://modareseen.com/",
    "location": "USA",
    "start_date": "Jan 2023",
    "end_date": "Oct 2023",
    "description": [
      "Developed and maintained web applications using Next.js and Material-UI for frontend development",
      "Designed and implemented robust APIs using Firebase for backend services",
      "Managed payment integration using Fawaterak API for secure transactions",
      "Collaborated with a team of three developers to deliver high-quality features",
      "Optimized application performance and ensured security and scalability"
    ]
  },
  {
    "title": "Frontend Developer Intern",
    "subtitle": "Majdy Yaaqoub Center",
    "url": "https://www.myf-egypt.org/aswan-heart-centre/",
    "location": "Cairo, Egypt",
    "start_date": "May 2023",
    "end_date": "Jul 2023",
    "description": [
      "Developed user interfaces using Next.js and modern web technologies",
      "Collaborated with the center's team to implement design requirements",
      "Utilized GitHub for version control and collaborative development",
      "Contributed to enhancing the center's online presence and user experience"
    ]
  }
]
