[
  {
    "id": "0",
    "title": "Onclick Platform",
    "subtitle": "A learning management system (LMS)",
    "description": "I spearheaded the development of a cutting-edge learning management system platform. Our team utilized GitHub Projects for task management, Vercel for deploying and Azure for hosting our database; our TypeScript-based platform. We faced numerous challenges, notably implementing secure course upload features. To address this, we integrated Cloudflare for enhanced security and managed. Our backend server was efficiently crafted using Express.js and Node.js, boasting over 10,000 lines of code. We adhered to the SOLID principles to ensure optimal performance and maintainability of our codebase.",
    "photo": "/projects/onclick.png",
    "url": "https://travel-advisor-rose.vercel.app/",
    "code_url": "https://github.com/onclick-academy/onclick",
    "skills": ["Nextjs v14", "Nodejs", "Azure", "Cloudflare", "TSX", "Express", "PostgreSQL", "Prisma Orm"]
  },
  {
    "id": "4",
    "title": "Deliciousss",
    "subtitle": "A food recipe application",
    "photo": "/projects/delicious.png",
    "description": "As a frontend developer, my passion lies in crafting delightful food recipe applications. I utilize external APIs to seamlessly fetch and display mouthwatering dishes from around the world, complete with step-by-step instructions. My dedication is to create interactive culinary platforms that allow users to explore and cook their favorite dishes effortlessly and with flair.",
    "code_url": "https://github.com/0marsalah/deliciousss",
    "url": "https://deliciousss-demo.vercel.app/",
    "skills": ["React", "API", "StyledComponent", "JS", "Animation"]
  },
  {
    "id": "2",
    "title": "Modareseen",
    "subtitle": "An integrated educational platform",
    "description": "As a full-stack developer, I spearheaded the development of Modareseen.com, seamlessly integrating Firebase's suite of tools. On the backendm, My focus was on ensuring scalability, performance, data integrity, and security. On the frontend, I used Material-UI to create an appealing and user-friendly interface with a consistent design language and responsive layout. My comprehensive efforts in both frontend and backend development were instrumental in delivering a cohesive and efficient web application tailored to user needs.",
    "code_url": "",
    "url": "https://modareseen.com/",
    "photo": "/projects/mod.png",
    "skills": ["TypeScript", "tsx", "Nextjs", "Material-UI", "Firebase", "Github"]
  },
  {
    "id": "1",
    "title": "Grandeur",
    "subtitle": "An online shopping store for watches",
    "description": "As a frontend developer, I specialize in creating visually appealing and user-friendly online watch shops. Leveraging plain CSS and Swiper.js, I design interfaces with consistent aesthetics and responsive layouts, ensuring an enjoyable shopping experience for customers.  I create user-friendly interfaces that cater to both Arabic and English-speaking users. My focus is on crafting efficient and captivating web platforms tailored to meet the needs of watch enthusiasts and shoppers.",
    "photo": "/projects/grandeur.png",
    "code_url": "https://github.com/0marSalah/grandeur-v1",
    "url": "https://grandeur-neon.vercel.app/",
    "skills": ["reactjs 18", "CSS", "Animation", "Github", "Vercel"]
  }
]
